//1. Вывести на экран Первую букву имени из символов "*" (звездочка)
#include <iostream>//Ввод-вывод
using namespace std;// Использование стандартного пространства имен

int main() {
    std::cout << "  *  " << std::endl
              << " * * " << std::endl
              << "*****" << std::endl
              << "*   *" << std::endl
              << "*   *" << std::endl;
    return 0;
    std::getchar();//ожидание ввода,чтобы прога
    std::getchar();//не закрывлась после выполнения

    return 0;
}

